// 1) კომენტარების სახით ახსენით javaScript-ში როგორ შევქმნათ ცვლადი და რა ტიპის ცვლადები გვაქვს.
// const - უცვლელი ცვლადი, რომლის მნიშვნელობის შეცვლა აღარ შეიძლება
// var - ძველი გზა ცვლადის შესაქმნელად 
// let - თანამედროვე გზა ცვლადის შესაქმნელად 

// 2) შექმენი ცვლადი name და მიეცი შენს სახელს მნიშვნელობა. კონსოლში დაბეჭდე: "გამარჯობა, მე ვარ [შენი სახელი]".

let name = "თამთა"; 
console.log("გამარჯობა, მე ვარ " + name);

// 3) შექმენი ორი ცვლადი age და city. დაბეჭდე წინადადება: "მე ვარ X წლის და ვცხოვრობ Y-ში".
let age = 21;
let city = "tbilisi";
console.log("მე ვარ " + age + " წლის და ვცხოვრობ " + city + "-ში");

// 4) შექმენი ცვლადი isStudent და მიანიჭე მნიშვნელობა true ან false. დაბეჭდე: "სტუდენტი ვარ?" და პასუხი.
let isStudent = true; 
console.log("სტუდენტი ვარ? " + isStudent);

// 5) შექმენი უცვლადი ცვლადი და ცადე მისი შეცვლა. კომენტარების სახით ახსენი რა მოხდა და რატომ მოხდა ეს.

// 6) შექმენი ორი ცვლადი a და b. დაბეჭდე მათი:
// ჯამი
// სხვაობა
// ნამრავლი
// განაყოფი

let a = 5;
let b = 5;

console.log("ჯამი: " + (a + b)); 
console.log("სხვაობა: " + (a - b));
console.log("ნამრავლი: " + (a * b));
console.log("განაყოფი: " + (a / b)); 

// 7) შექმენი ცვლადი firstName და lastName. გააერთიანე ისინი "fullname"-ში.
let firstName = "tamta";
let lastName = "bakhtadze";
let fullname = firstName + " " + lastName;
console.log("" + fullname);

// 8) prompt-ით მომხმარებელს შემოატანინე სახელი და დაბეჭდე კონსოლში.
let saxeli = prompt("saxeli: ");
console.log("hello " + saxeli);
// 9) prompt-ით მომხმარებელს შემოატანინე ასაკი და alert-ით გამოიტანე მესიჯი "შენი ასაკია [აქ ასაკი]"
let userAge = prompt("asaki:");
alert("შენი ასაკია " + userAge);


// 10) კომენტარების სახით ახსენი რას აკეთებს prompt
// prompt არის JavaScript-ის ფუნქცია, რომელიც გამოყავს პატარა ფანჯარა (popup) ბრაუზერში,
// სადაც მომხმარებელს შეუძლია შეიყვანოს მონაცემი (ტექსტი ან რიცხვი). prompt აბრუნებს იმ მნიშვნელობას,
// რასაც მომხმარებელი ჩაწერს, როგორც ტექსტს.
// 

// 11) კომენტარების სახით ახსენი რას აკეთებს alert
// alert - აჩვენებს შეტყობინებას პატარა ფანჯრის (popup)-ში.

// 12) prompt-ით სთხოვეთ მომხმარებელს რიცხვი. 
// შემდეგ მომხმარებლის მიერ შემოტანილ რიცხვზე მოახდინეთ ყველა მათემატიკური ოპერაცია და გამოიტანეთ console-ში
let number = prompt("შეიყვანე რიცხვი:");
number = Number(number);

console.log("რიცხვი + 5 = " + (number + 5));
console.log("რიცხვი - 5 = " + (number - 5));
console.log("რიცხვი * 5 = " + (number * 5));
console.log("რიცხვი / 5 = " + (number / 5));

