# მომხმარებლის მიერ შეყვანილი მონაცემები
name = input("შეიყვანეთ თქვენი სახელი: ")
surname = input("შეიყვანეთ თქვენი გვარი: ")
age = input("შეიყვანეთ თქვენი ასაკი: ")
country = input("შეიყვანეთ თქვენი ქვეყანა: ")

# დიდი ტექსტის შექმნა f-სტრიქონის გამოყენებით
text = f"""
მომხმარებლის ინფორმაცია:
სახელი: {name}
გვარი: {surname}
ასაკი: {age}
ქვეყანა: {country}

მოხარული ვართ, რომ გვესტუმრეთ, {name} {surname}! 
თქვენი ასაკი {age} წელია და თქვენ ცხოვრობთ {country}-ში.

"""

# შედეგის დაბეჭდვა
print(text)