# 5. ახსენით რომელი გირჩევნით და რატომ:
#```python
#num = 2
#print("Hello " + str(num) + " world")
#print("Hello", num, "world")
#print(f'Hello {num} world')
#```
#კოდების სისუფთავე: f-string არის უფრო მკაფიო, უფრო კომფორტული და უბრალო.
# არ გჭირდებათ დამატებითი სტრინგის კონვერტაცია ან გაბმული ცვლადები.

#დაბალი შესრულება: f-string უფრო ეფექტურია, რადგან არ საჭიროებს დამატებით ოპერაციებს, 
#როგორიცაა str()-ის გამოყენება ან ავტომატური სტრინგის შემადგენლობა.

#თანამედროვე სტანდარტი: f-string არის Python 3.6-ის შემდეგი სტანდარტი და ყველაზე ფართოდ გამოყენებული მეთოდი.
