# 2) კომენტარების სახითახსენით import random
#import random - ეს ბრძანება ჩართავს Python-ის random მოდულს
#random მოდული გვაძლევს შესაძლებლობას ვიმუშაოთ შემთხვევით მნიშვნელობებთან
#მაგალითად, შეგვიძლია გამოვიყენოთ:
# - random.randint(a, b) -> შექმნის შემთხვევით მთელ რიცხვს a და b შორის
# - random.choice(list) -> აირჩევს ერთ ელემენტს სიიდან შემთხვევითად
# - random.shuffle(list) -> ცვლის ელემენტების რიგს სიაში შემთხვევითად
#ელემენტი შეიძლება იყოს სიტყვა, ციფრი ან სხვა ტიპის მონაცემი
#კომპიუტერი ირჩევს ელემენტს "შემთხვევითად", ანუ ყველა ელემენტს ერთნაირი შანსი აქვს
#ეს გამოსადეგია თამაშებში, შემთხვევითი სიტყვების ან ციფრების არჩევისთვის.
