// ```level 93:
// 1 შექმენი ფუნქცია რომელიც მიიღებს რიცხვების array-ს და დააბრუნებს object-ს სადაც იქნება ყველაზე პატარა რიცხვი და ყველაზე დიდი რიცხვი 
// გამოიყენე for loop და if else ფუნქცია უნდა იყოს ცალკე ფაილში და ექსპორტირებული და მეორე ფაილში უნდა მოხდეს იმპორტი და გამოყენება
export function getMinMax(arr) {
  let min = arr[0];
  let max = arr[0];

  for (let i = 0; i < arr.length; i++) {
    if (arr[i] < min) {
      min = arr[i];
    } else if (arr[i] > max) {
      max = arr[i];
    }
  }

  return { min, max };
}


// 3 შექმენი ფუნქცია რომელიც მიიღებს რიცხვების array-ს და დააბრუნებს ყველა იმ წყვილს რომლის ჯამი არის 27 გამოიყენე nested for loop if და შეინახე შედეგი ახალ array-ში 
// ფუნქცია უნდა იყოს მოდულში ექსპორტირებული და სხვა ფაილში იმპორტირებული და გამოყენებული

// 4 შექმენი ფუნქცია რომელიც მიიღებს ტექსტს და დააბრუნებს იგივე ტექსტს მაგრამ ციფრების გარეშე გამოიყენე for loop if და continue ფუნქცია უნდა იყოს ცალკე ფაილში და
//  გამოყენებული იყოს იმპორტის საშუალებით სხვა ფაილში```